// 1
// создайте переменную и присвойте ей числовое значение
// если число положительное, выведите в консоль сообщение "Положительное"
// если число отрицательное, выведите в консоль сообщение "Отрицательное"
let ttt1 = 2;
if (ttt1 > 1) {
  console.log("положительное");
} else {
  console.log("отрицательное");
}

// 2
// создайте переменную и присвойте ей числовое значение
// проверте на четность значение переменной и выведите в консоль сообщение "четное" или "нечетное"
let ttt2 = 4;
if (ttt2 % 2 === 0) {
  console.log("Четное");
} else {
  console.log("Нечетное");
}

// 3
// создайте переменную
// проверьте на тип данных если значение ровняется объекту то выведите консоль "объект является ссылочным типом данных" иначе выведите консоль "тип {тип переменной} является примитивным типом данных"
let ttt3 = {};
if (typeof ttt3 == "object") {
  console.log("обьект являеться ссылочным типом данных");
} else {
  console.log("тип {typeof ttt3} является примитивным типом данных");
}

// 4
// Создайте обьект с ключами name и age
// если возраст больше 17, то выведите в консоль сообщение "Привет, меня зовут {имя} и это мой первый код" если нет то выведите в консоль "Привет, меня зовут {имя} и я не совершеннолетний"
let ttt4 = { age: 25 };
if (ttt4.age > 17) {
  console.log("Привет, меня зовут {имя} и это мой первый код");
} else "Привет, меня зовут {имя} и я не совершеннолетний";

// 5
//  Создайте переменную name и age.
// проверайте что переменная name содержит строковое значение и age - числовое значение
// если все верно - выведите сообщение "Все введено верно"
// если какой-то тип данных не совпадает - вызовите ошибку "Данные введены не верно"
let name = "Tilek";
let age = 25;
if (typeof name === "string" && typeof age === "number") {
  console.log("Все введено верно");
} else "Данные введены не верно";

// 6
// создайте переменную со строкой
// если регистр маленький переведите строку в верхний регистр,а если большой переведите в нижний
let ttt6 = "tilek";
if (ttt6 === ttt6.toLowerCase()) {
  console.log(ttt6.toLocaleUpperCase());
} else {
  console.log(ttt6.toLowerCase());
}

// 7
// создайте пременную lang и присвойте ей значение 'en' или 'ru' или 'de' или 'kg'
// изпользуя тернарный опертор выведите сообщение в зависимости от значения lang
// lang = 'en' выведет 'This is english'
// lang = 'ru' выведет 'Это русский'
// lang = 'de' выведет 'Das ist Deutsch'
// lang = 'kg' выведет 'Бул кыргыз тили'
let lang = "kg";
let message =
  lang === "en"
    ? "This is english"
    : lang === "ru"
    ? "Это русский"
    : lang === "de"
    ? "Das ist Deutsch"
    : lang === "kg"
    ? "Бул кыргыз тили"
    : console.log(message);

// 8
// создайте обьект { name : "Hello", age: 19 , status: "student",  сlass: "JS-54", school: "Makers" }
// если возраст больше или равен 20 и статус равен student и школа равна Makers, то выведите в консоль  сообщение
// "Привет, меня зовут {name} и я студент в {school} классе {class}"
// если нет то выведите в консоль
// "Привет, меня зовут {name} и мне {age} лет"
let ttt8 = {
  name: "Hello",
  age: 19,
  staus: "student",
  class: "JS-54",
  school: "Makers",
};
if (ttt8.age >= 20 && ttt8.staus === "student" && ttt8.school === "Makers") {
  console.log(
    `Привет, меня зовут ${ttt8.name} и я студент в ${ttt8.school} классе ${ttt8.class}`
  );
} else {
  console.log(`Привет, меня зовут ${ttt8.name} и мне ${ttt8.age} лет`);
}

// 9
// В переменной minute лежит число от 1 до 60. Определите в какую четверть часа попадает это число (в первую, вторую, третью или четвертую).
// Так же если число не находится в диапазоне от 1 до 60, то выведите "Число не верное"
let minute = 61;
if (minute >= 1 && minute <= 15) {
  console.log("Первая четверть");
} else if (minute >= 16 && minute <= 30) {
  console.log("Вторая четверть");
} else if (minute >= 31 && minute <= 45) {
  console.log("Третья четверть");
} else if (minute >= 46 && minute <= 60) {
  console.log("Четвертая четверть");
} else {
  console.log("Число не верное");
}

// 10
// Дана строка из 6-ти цифр. Проверьте, что сумма первых трех цифр равняется сумме вторых трех цифр. Если это так - выведите 'да', в противном случае выведите 'нет'.
let ttt10 = "123123";
if (ttt10[0] + ttt10[1] + ttt10[2] === ttt10[3] + ttt10[4] + ttt10[5]) {
  console.log("да");
} else {
  console.log("нет");
}

let arr1 = [5, 3];
console.log(arr1.reduce((a, b) => a + b)); // Выведет 8

let arr2 = ["5", 3];
console.log(arr2.reduce((a, b) => a + b)); // Выведет '53'
